[
    {
        "reviewerName": "Bob Davies",
        "rating": 1,
        "reviewText": "Hopeless, they delete appointment requests, I've submitted 4 and still haven't been able to see a doctor. Had hoped it would improve under new management, but nope, still incompetent. I sent a detailed complaint about it last year and still no change. Passive aggressive staff replying to reviews blaming people and a doctor posting their own review lying about how great they are is just the tip of the iceberg. Over forty reviews here complaining about exactly the same problems, with no action from the practice.",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Hamdah Al Raisi",
        "rating": 1,
        "reviewText": "Very bad experience with New Bank Health Centre.The staff are rude and unhelpful. They ignore patients, spend time chatting and laughing during working hours, and don’t take our concerns seriously. Every time …More",
        "reactions": 7,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Joyce Louis",
        "rating": 1,
        "reviewText": "I'm extremely disappointed with the recent changes at this GP surgery. I had a blood test scheduled but was given a date I couldn’t attend. When I managed to make time, the appointment was cancelled due to \"unforeseen circumstances.\" …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Klaudia Kania",
        "rating": 1,
        "reviewText": "The Worst GP in Manchester!I am extremely disappointed and frustrated with the service provided by this practice. The level of care and professionalism is shockingly poor, and I’m genuinely appalled by the way patients are treated. The staff are not only unhelpful but often rude and dismissive, making it incredibly difficult to get even the most basic appointment advice or simply book one.Trying to book an appointment is an absolute nightmare. Instead of making things easier for unwell patients, the process adds stress, anxiety, and frustration. You’re passed between phone lines, broken websites, and conflicting instructions; and still end up with no appointment. It feels like no one takes responsibility, and the entire system is set up to discourage people from accessing care.Terrible experience, awful management. This practice desperately needs a complete overhaul.",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Javad Moazami",
        "rating": 1,
        "reviewText": "Rating: 1/5 - Extremely DisappointingServiceUnfortunately, my experience at this clinic was very unpleasant. The behavior of …More",
        "reactions": 8,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "O A",
        "rating": 1,
        "reviewText": "The worst GP in Manchester. The appointments system is from 1965, where you have to wake up at 6am and file in the form online, or else they are closed by 8am. And then you sit until next day in pain without medication. …More",
        "reactions": 8,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "OD",
        "rating": 1,
        "reviewText": "If I could give zero stars, I would! This GP is so shameless, that they have now even time-limited sending admin requests and sick notes as well. Just like the appointments. They are open from 8am to hardly 10am or 11am. Who makes them think that we are available during those times when someone is sick or at work or commuting?? Instead of making it easy for sick patients to book appointments and requests at their convenience, they stress you out more, make you more anxious and sick. Horrible management!In Liverpool and London, almost all GPs have open appointment systems, you can book appointments online and choose your date and time. Admin requests, medical reports and sick notes are processed within 48 hours no questions asked and they even deliver medication to your house! But look at these guys, they are operating on biblical systems and it is 2025!!Do yourselves a favour and please open up your booking systems. Its not that hard. Stop being so shameless! I will be reporting this GP to Health Ombudsman, NHS and MP.",
        "reactions": 7,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "M Naser",
        "rating": 1,
        "reviewText": "Unacceptable Service – Disrespectful and Unprofessional.I am extremely disappointed and frustrated with the service provided by this GP. …More",
        "reactions": 9,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Faiza Shahbaz",
        "rating": 1,
        "reviewText": "i always fill the form for appointment any time during day but I tried to fill the form today for my son.it's not allowed me to do that.when phone the surgery they said you have to do next day.there is possibility If someone cancel appointment and they have our request and they can deal with our request.",
        "reactions": 4,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Rahul David",
        "rating": 1,
        "reviewText": "Worst GP practice ever. Been 2 months for my medical record and I still havnt recieved it. Suppose to be within 30 days. Now I cant work because I can't renew my badge.",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "christian careddu",
        "rating": 1,
        "reviewText": "i don’t know what to do no more.been waiting over a month for a referral letter to have access at my medications. …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Caitlin Foy",
        "rating": 1,
        "reviewText": "Such poor service. They don’t listen to anything you’re saying about your problems. And if they do, they don’t help you out and give you anything to be at ease. They just throw blood tests at you constantly. Wouldn’t recommend whatsoever. …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "inverted llama",
        "rating": 5,
        "reviewText": "Very digital first practice, amazingly I've managed to get a call back within 15 minutes of logging a case online, none of this waiting around to call exactly at 9am.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Ahmed Ali",
        "rating": 1,
        "reviewText": "Very disappointed.My wife had an appointment at 11 am. With ailing health reached on time.But when your self check in machine has technical fault waited fot the receptionists.The …More",
        "reactions": 11,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "dominic wedgwood",
        "rating": 4,
        "reviewText": "I have had nothing but positive experiences with this surgery. I did drop a star simply because you have to do everything via e-forms on the website, however my GP as well as the Nurse I see regularly are lovely and truly seem to care about my health.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Faiza Shahbaz",
        "rating": 1,
        "reviewText": "No routine appointment available. They said no more appointments for non emergencies.Its Disgusting. Not coprative staff at all.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Waseem Bashir",
        "rating": 1,
        "reviewText": "I am writing to express my deep disappointment with the service I have received from New Health Bank over the past 8 months. Despite being promised a referral for surgery in November 2023, I have yet to receive any follow-up. Each time I …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Paul Jepson",
        "rating": 5,
        "reviewText": "I've been a GP here for a year now and can honestly say it's the best practice I've worked at in my 15 year career. It's a brilliant space with five large clinic rooms, a huge waiting room and lots of space for administrative functions. …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "muhammad raza",
        "rating": 1,
        "reviewText": "Disrespectful staff no drinking facilities for patients. If ask from staff they just ignored, and suggest to buy from next door fuel pump. Not acceptable.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Syed Joshim",
        "rating": 5,
        "reviewText": "I would like to express my appreciation for the outstanding care provided by New Bank Health. The team consistently helps me with my health conditions, and I am particularly impressed by their efficiency in scheduling same-day appointments. …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Kenny J",
        "rating": 1,
        "reviewText": "Was a patient for 10 plus years with long term illness surgeons released my to GPS care now been struck off for moving 400 metres further and to make matters worse was sent for scan now i can't get results because I'm not a patient so have to find new doctors and  wait longer to find out if I've a serious problem thanks new bank",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Nabeeha",
        "rating": 1,
        "reviewText": "This surgery is getting worst day by day, i have to w8 for a blood test for 4 weeks, and when i went for  a blood test waited there for half hr just to be told that nurse is not coming. So booked another blood after 2 weeks and got a call …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "David Aligbe",
        "rating": 1,
        "reviewText": "IF YOU WANT TO DIE AND BE TREATED LIKE YOU ARE INSIGNIFICANT THEN YOU HAVE COME TO THE RIGHT PLACE. The receptionists are vile and diabolical when speaking to you. They are more focused on making tea and coffee and having conversations …More",
        "reactions": 5,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Jayne Atkinson",
        "rating": 1,
        "reviewText": "Phoned for appointment told to go online did this & waited all day for a call describing my symptoms of severe pain down my leg and numb foot was told sounds like a hernia ? In my leg really & phone was put down on me, phoned next day a …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Faiza Amjad",
        "rating": 1,
        "reviewText": "I requested a letter from GP and was not aware that this service will be charged as I never used this service before. Also no body informs me neither the GP or when I rang surgery they guy just simply said it’s ready for collection. When I …More",
        "reactions": 4,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mohammed Ahmed",
        "rating": 1,
        "reviewText": "This is quite possibly the worst GP in britian i struggled to give 1 starThey do everything to avoid seeing you in person make it so extremely difficult to speak to a doctor and if they do give you an appointment it would be at a …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Fatimah Abboud",
        "rating": 5,
        "reviewText": "Nearly always amazing and I almost always get appointments on the same day.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Moe Yafai",
        "rating": 1,
        "reviewText": "The service in this GP service is below standards and unprofessional. As the patient you will be required to continually chase up what is needed and in my case of being disabled they systematically discriminate. To be fare, once getting an appointment the nurses and doctors are good but all appointments are by telephone",
        "reactions": 8,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Fazel rabi Rustamkhel",
        "rating": 1,
        "reviewText": "Seriously, I dont know where to go for a genuine complaint, I am so annoyed with the service here, Every time my kids become ill I and my wife thinking how to deal with it, as this practice does not help at all. …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Videl Powell",
        "rating": 1,
        "reviewText": "The majority of staff are rude, unhelpful and I believe are unaware of how to treat people with mental health problems. They say someone is going to ring and nobody does and don't communicate properly what's been done or what the plan is. …More",
        "reactions": 5,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Noyon LLC",
        "rating": 1,
        "reviewText": "should have the option of 0 stars! Doctors and nurses are fine but these arrogant reception staff needed to get their heads out their backsides! such rude ill mannered staff at the forefront of an establishment where people go out of no …More",
        "reactions": 9,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "F Rashid",
        "rating": 1,
        "reviewText": "Awful gp practice.I have been suffering with health issues and have been trying to get an appointment for 3 days now. …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Polis Sidiropoulos",
        "rating": 1,
        "reviewText": "Incompetent manager and staff. I have been in this country for 15 years, and this is the first surgery/health center who questions a EU ID card. They welcome new patients but they do make you unwelcome and they are unwilling to help. They …More",
        "reactions": 7,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Satvinder Singh",
        "rating": 1,
        "reviewText": "11 AM Thu Nov 11 2022:-One of the worst GP Surgery. If there were any 0 Stars, I would have chosen the …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Euan Gilchrist",
        "rating": 5,
        "reviewText": "I've been registered at this GP for over a year. Contrary to other reviews  the staff have always been courteous and helpful both in the practise and especially so over the phone. Sometimes there is a short wait for appointments but this is …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Rohail Kiani",
        "rating": 5,
        "reviewText": "Never had any issues here, get seem quickly, never too packed like other surgeries, friendly staff",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Abz G",
        "rating": 1,
        "reviewText": "Useless customer service, when you want to make an emergency appointment you have to wait on the line for more than 30 minutes and when they finally answer the call they tell you should have called earlier after explaining to them that you …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Abdul Hadi",
        "rating": 1,
        "reviewText": "This is the worst GP surgery in the country. Please avoid registering there. I'm suprised they are allowed to operate and still have a licence to practice. The staff are VERY rude, cude sometimes as well and online medical queries are …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mylinh Nguyen",
        "rating": 1,
        "reviewText": "If I could give 0 reviews I would, I’ve had so many problems with this GP, to be quite honest it’s not the doctors or nurses it’s the people on reception and their attitude and the service this GP provides, if you don’t like your job, don’t …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Lynne Spilsbury",
        "rating": 5,
        "reviewText": "Hi I changed over to New bank about 7 months ago,because I have  wasted 30yrs of my life being at the valance centre ,who I can honestly say  they did nothing for me except cause my medical problems. When I joined   Newbank I couldn't …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "ADEEL MAHMOOD",
        "rating": 1,
        "reviewText": "So annoying and such waste of time!Repeatedly I am thrown between the GP and the pharmacy only to find out its the …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Fatima a",
        "rating": 5,
        "reviewText": "Thank you to Tina who does my blood tests quickly and efficiently Appreciate it every time",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Amina Sheik mohaddin",
        "rating": 1,
        "reviewText": "Worst general practice from 2019 up to now! They don’t see any patients only through video call and through phone call, even for blood test they would send their patient to other practices. My son who is almost 5 couldn’t even get his vaccins the practice should shut down!!",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Imran Hussain",
        "rating": 5,
        "reviewText": "I have been registered with New Bank Health Centre from last four years , all the front staff , and Manager are very helpful . Dr Ali , Dr Singh do there best to help you . i see some negative comments, people need to understand asking for …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Martina Mammoli",
        "rating": 1,
        "reviewText": "The level of unprofessionalism and lack of communication between all staff is beyond words. …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Chloe Mitchell",
        "rating": 2,
        "reviewText": "Reception staff are quite rude and unhelpful, the wait is always long, I once asked the person at reception how long is the delay and they replied 'have a look, do you see many waiting?' There were only a couple of people in the waiting …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Denise Osman",
        "rating": 1,
        "reviewText": "The receptionist is unbelievably rude to everyone who dares to walk in or phone in. She should be sacked.  I sat waiting for over half an hour and all she did is complain about her work load to collegues and patients. …More",
        "reactions": 4,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mariah Ashfaq",
        "rating": 1,
        "reviewText": "Compared to other gps they do provide appointments. however, its taken them months to even upload my husbands details on the system. the lady clearly said she'll give me an appointment today but then said she didn't. very appalled with the …More",
        "reactions": 4,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Richard Brown",
        "rating": 5,
        "reviewText": "Been with New Bank for a few years now. Yes like all Practitioners there’s a wait to see a doctor but when you see one they know what they are talking about.  Receptionist are as Helpful as they Can be. Sometimes when they are stressed …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Sahra Ahmad",
        "rating": 1,
        "reviewText": "The service is crap. If i was allowed to use even more bad word then i would the receptionists are totaly out of there mind. If Patients are late then they dnt get to see the doctor and of theire are running late is no problem they have all …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Lukasz Buczko",
        "rating": 1,
        "reviewText": "To be honest is the Best clinic as you geting your problem sorted by the so called Doctors working at the reception desk they Will strictly interview you before and if decide they might send your request to the (who knows whats the reason …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Sasha Suhail",
        "rating": 1,
        "reviewText": "Absolutely ridiculous service! Although most doctors are very rude and unhelpful to their patients but out of all of them Dr Singh is the rudest most arrogant racist woman in this surgery!!!! Pathetic woman..... she acts like she does some …More",
        "reactions": 5,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "James Lee",
        "rating": 2,
        "reviewText": "I was on constant redial 60 times in a row when I tried ringing for an on the day appointment. They boast that they're open til 8pm but the surgery time finishes around 5.. the only thing you can do til then is collect prescriptions. They should have at least a few late evening surgeries running through the week",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Chenoor Abdulla",
        "rating": 1,
        "reviewText": "I would not recommend to anyone in Manchester, the worst gp for contacting and getting in touch with anyone in this centre, above all they don't give you very safe medication for every medication you need to be referred to hospital, now I …More",
        "reactions": 7,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Junna",
        "rating": 1,
        "reviewText": "One of the doctors gave very poor service, she stated how there is nothing to help me with my issue, she even stated I can't do anything about it and made a face as if she was clueless! And I had to even tell her of the medicine I had heard …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Elena Her",
        "rating": 5,
        "reviewText": "The best gp of Manchester,the appointments are the same day of your call or the Next working day,you are always assisted on your appointment time and not 1 hour later,quite different in the gp than I am right now (five oaks family practice) very professional staff",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Pargat sandhawalia",
        "rating": 1,
        "reviewText": "It was my appointment today at 2:30 pm  . I live just 10 steps away from new health bank centre. I visited there at 2:20 and kept waiting for till 2:50 but no one answered. Receptionist Muslim lady says they gonna give u call with bad attitude like she' everything.if u can't see patients don't call them",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "abdul llah",
        "rating": 1,
        "reviewText": "As all the rest of the people have the more or less the same thing. This is the qirst practice and you should avoid wasting your time there. Terrible surgery, staff and whole ethos of the place. To say its shameful will be a praise for this surgery",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Michaela Berankova",
        "rating": 2,
        "reviewText": "It's unbelievable how this Gp practice go down.When you call to make appointments like you use to before this s....d pandemic.There told you fill form online. …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Katie W",
        "rating": 3,
        "reviewText": "Unfortunately it's the closet GP in my area - really unprofessional and rude receptionists is what drags my rating down for them. Never had a problem with any of the doctors. That and the fact that is virtually impossible to get an appointment with them, but when you do, the doctors are really helpful.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mo Ramzan",
        "rating": 1,
        "reviewText": "At first when I registered it was good, I could get an appointments late because of what time they are open till. Now a days I am told to ring at 8am if I wanted an appointment at around half 4 or 5pm, which I did and then I am told to ring …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Maha Elmi",
        "rating": 1,
        "reviewText": "No time for human been... very disappointed",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Relaxing, Deep Sleep And Meditation Club",
        "rating": 1,
        "reviewText": "Surgery reception is worse in the whole universe,  very rude and insulting behaviour,  always, again editing review, worse receptionist services off all time",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "ghassan 1978LL",
        "rating": 1,
        "reviewText": "I think this is the worst GP in the UK ever rude staff and when you ask for the manager always the answer is:”sorry the manager not in” also Dr Singh is really rude and gave us a wrong medicine and when you ask her any questions she even …More",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "M M",
        "rating": 1,
        "reviewText": "Terrible reception lady, how she is working customer facing is unknown to me, her resentment towards walk in patiencents like me was not what I expected. If you don't like your job find something else, are my taxes not paying your wages. …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Ali",
        "rating": 1,
        "reviewText": "Booked an urine test in may and they say its 5 working days and never came back with results phone so many times and they say the same thing go online and check which dose not help result came back on 4th of july. Even at some point they said to me that we don't have your test .",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mohammad Ijaz",
        "rating": 1,
        "reviewText": "The most unhelpful reception/admin staff you can get. GO ONLINE is their best advice over the phone on any matter to which they will take 2-4 days to get back to you! Really annoyed with them. Rude and unprofessional …More",
        "reactions": 6,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Guillermo Castilla",
        "rating": 2,
        "reviewText": "Cordial and kind but not a great service.It usually takes long to get an appointment and you also have to wait a bit there. Staff changes so you may not always go with the same doctor.Once I was ill and I got a diagnostic, then it ended up being something else...",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Laila Jaafar",
        "rating": 1,
        "reviewText": "I came here for an ultrasound scan today (11 Dec) at 4.45pm. Waited on the second floor as I was asked to wait until the member of mediscan call me. But NO ONE has called me for the scan until all of the mediscan staffs left. And I WAS ASKED TO REBOOK MY APPOINTMENT??? Give back my 1 HOUR OF WAITING IN PAIN",
        "reactions": 5,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "George Norrell",
        "rating": 1,
        "reviewText": "You know what not everyone has internet access you just can't see a doctor face to face lazy lay aboutsMust find another doctor who does care what a waste of time these doctors are …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Natalia Kowalska",
        "rating": 5,
        "reviewText": "I have been with New Bank Health Centre more than 3 years. On the beginning managing was poor so customer service but now since couple of months I can't say a bad word about them. As I have noticed there is new manager and work is more organised as well as friendly.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "m hoque",
        "rating": 1,
        "reviewText": "very poor customer service. I joined with them in January 2015. they have my all previous medical records in their system. my previous gp transferred all my medical records to them. recently they denied me to provide all my previous records on a letter I requested. I am preparing for legal action.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Adnaan Abbas",
        "rating": 1,
        "reviewText": "The worst gp service ever. Staff is so rude and disgusting and pompous. Untrained and incompetent with a bad attitude. NHS really odd to take a deep look into this mess of a surgery.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Hafsa Bakari",
        "rating": 1,
        "reviewText": "I never ever write reviews but the admin/reception team here are something else, I totally agree with every complaint made against them in the reviews because that's how they've treated me, I was deducted from the practise due to my …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Sara Haile",
        "rating": 5,
        "reviewText": "Lovely experience staff really  nice cannot fault the care  such warm welcoming when I have  been  there  a big  thank-you to Alex & Sharon",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Kathie Higginson",
        "rating": 3,
        "reviewText": "The phone system is a joke, and sometimes the receptionists seem rude and dismissive, but I have never had difficulty getting an appointment when I've needed one, and all of the medical people I've dealt with have been fantastic - understanding and have all immediately put me at ease.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Karla Sereice",
        "rating": 4,
        "reviewText": "Much better since new manager Ash has taken over, i think the fiery receptionist have been sacked. Helpful Maria & Shaz are still there. New Doctors are better too.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Al Raza",
        "rating": 1,
        "reviewText": "Imagine a dictor making calls and outting it down and knowing its getting paid for because it counts as a appointment ,you coukd die as long as the longest standing doc is mikking it",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Carole Dixon",
        "rating": 1,
        "reviewText": "The receptionist are rude discriminate against your mental health The office manager is just as bad lies and more lies …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "SAAD ULLAH",
        "rating": 1,
        "reviewText": "I don't normally write a review. But this time I must have to say that this is the worst GP / Health Centre I have ever seen in the UK. Would not recommend it to someone who wants to join.",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Adnan",
        "rating": 1,
        "reviewText": "Really Poor customer service. Reception Staff is rude. They don't see the patient on time. If you have appointment be ready to wait for 15 to 30 minutes more than the given time.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Arcosoft Gaming Studios",
        "rating": 1,
        "reviewText": "Absolute clowns !!! Worst GP in Manchester.",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Rubel Miah",
        "rating": 1,
        "reviewText": "Would give zero star if there was the option. Been trying to book vaccination for my baby and theyve made it such a nightmare to do such a simple process of booking a appointment",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Victor Happy",
        "rating": 5,
        "reviewText": "I think this is one of the best general practice around,the admin staff are bright and friendly they also have a smile on there little chops especially one them you know who you are,in my experience people need to wind there necks in.people …More",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "adnan arshad",
        "rating": 1,
        "reviewText": "Untrained staff at reception doesn't have any clue everytime phone been told go to website and website is complacayed trying to make an appointment when you do get through if some one do reply they tell you something else rubbish  service …More",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Sana Mahdavi",
        "rating": 1,
        "reviewText": "I've had skin problems and the doctor just made it worse, I can't even go out of the house now because of her wrong medications. Please don't go to this GP if you care about yourself.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Saher",
        "rating": 1,
        "reviewText": "A receptionist by the name of \"Dee\" is awfully rude. If she doesn't want to work then she should just go and claim universal credit. Completely ruins people's days.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Feedback_Customer F",
        "rating": 1,
        "reviewText": "Awful place. It is nearly impossible to get any appointment by phone. You can start calling from 8:00 am and they do not answer till 8:20am saying all the appointments are fully booked when lines open at 8:00am (This has happened to me many times in that place). The staff very unfriendly and the service not good.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Jordan Ollerenshaw",
        "rating": 1,
        "reviewText": "The worse doctors in longsight really bad service bad attitude from staff really don’t care about their patients WOULD NOT RECOMMEND ATALL. Had better luck with doctor galatity",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "summaya Tariq",
        "rating": 3,
        "reviewText": "Hi, the present reception staff is very rude.the old stuff is very polite nd nice.spanish dr mayans is very very nice she is so so clam supportive nd helpful ...i like her so much.she is one of the best dr I have ever met..bless you maaam.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Shan Bar",
        "rating": 1,
        "reviewText": "World's Number One Worst Surgery and Worst Staff. PLEASE PLS DONT REGISTER YOURSELF IN THIS SURGERY,  GO SOME WHERE ELSE...I  don't want to give you any star. You guys are    - 100....",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "mediawise TM",
        "rating": 1,
        "reviewText": "Receptionist are very rude and don't really understand the patients enquiry no do they help this needs looking into just called up to make an appointment before I could finish she keeps referring go online book online that's the procedure …More",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Dimitris Georgakas",
        "rating": 5,
        "reviewText": "Great experience. They need to sort out their answering the phone cause it takes them some time but eventually they get there :) Other than that, excellent service, right on time with no problems whatsoever.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Anila Farooq",
        "rating": 1,
        "reviewText": "Very pathetic surgery please don’t register here. The online system Doctors don’t even bothered to call u and ask the issue, customer service is the worst, so rude.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Nuna",
        "rating": 1,
        "reviewText": "It is get very very bad I will change my Gp for anything I need thy ask me  book online  since Dr h Ali not there get very very bad",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "David Coverley",
        "rating": 1,
        "reviewText": "Reception are helpful now they have polite staff only thing I have bad 2 say is the male doctor there is incompetent since Dr Rizvi left the service has really declined",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Youcef Mariem",
        "rating": 1,
        "reviewText": "I prefer stay and suffer at home than call this gp (bad staff)",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Qaiser Shakeel Aslam Begum",
        "rating": 5,
        "reviewText": "The Staff Are Really Good And The Female Spanish Doctor Is Really Calm And Doesn't Rush.😀😀😀VIVA ESPAÑIA",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Adam Azelle",
        "rating": 1,
        "reviewText": "Rude staff unhelpful and they make you feel really unwanted and they just have an awful attitude towards the patients",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Nadeem Ahmed",
        "rating": 1,
        "reviewText": "WORST CUSTOMER SERVICE I HAVE EVEREXPERIENCED!!!Ignoring the customer. Long wait times and response times.poorly trained staff members.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Muhammad Yaseen",
        "rating": 1,
        "reviewText": "Recipients behaviour very bad n lazy even they don't have any smiles in there face,I don't no is there not anyone to check doctor surgerys?",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mianbali Khan",
        "rating": 1,
        "reviewText": "To make appointment need one month to tray every dayAnd you have neare to die.",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "BFDI and Palestine Fan 2763",
        "rating": 1,
        "reviewText": "Doctors are very good one receptionist very rude.Wont admit her mistake takes tried to blame me for her.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Muhammad Yasir Shafique",
        "rating": 1,
        "reviewText": "Rude",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Abdurahman Zafiri",
        "rating": 1,
        "reviewText": "The receptionist are the worst people and the rudest.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "shincy jojo",
        "rating": 1,
        "reviewText": "Very bad service and rude staffs, better not to register there.",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Hafsa Mohd",
        "rating": 1,
        "reviewText": "Horrible service. Awful booking system. Poor doctor - patient relation.",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Abdikadir Abdi",
        "rating": 1,
        "reviewText": "No good costumes service they are no reliable for the customer service",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "A B",
        "rating": 1,
        "reviewText": "Absolutely disgraceful. Avoid this place like it’s covid 19.",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Shaun Brown",
        "rating": 1,
        "reviewText": "As mentioned  in numerous  other reviews  the receptionist is extremely rude",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Kiran Ejaz",
        "rating": 5,
        "reviewText": "Most helpful doctor is dr ali and dr altaf",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "John Apetri",
        "rating": 1,
        "reviewText": "Worst experience. Weak staff. Every question that you have go online. Avoid",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Safin Mahdi",
        "rating": 5,
        "reviewText": "Good service thanks 🙏",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Usman Khalid",
        "rating": 5,
        "reviewText": "Good",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "einass Yousif",
        "rating": 1,
        "reviewText": "It's very badly .I will change it .",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "jane oakes",
        "rating": 5,
        "reviewText": "Nice clean place with helpful staff",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Phillip Mcmulkin",
        "rating": 1,
        "reviewText": "Absolute shambles of a service",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Godwin Jimmy",
        "rating": 5,
        "reviewText": "Good service",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "wheresemma walley",
        "rating": 1,
        "reviewText": "Useless!",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "amanda mitchell",
        "rating": 5,
        "reviewText": "Drs there helpful and staff",
        "reactions": 2,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "shalaw k",
        "rating": 1,
        "reviewText": "Very poor service..",
        "reactions": 5,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "chowdary TDP",
        "rating": 1,
        "reviewText": "No response",
        "reactions": 1,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Ibrahim Abdullah",
        "rating": 1,
        "reviewText": "Dr Singh 👎",
        "reactions": 3,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "PeeingDuck",
        "rating": 5,
        "reviewText": "Good",
        "reactions": 0,
        "reviewDate": "",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Rosemary Madakadze",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Anda Katkovska",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "MASIH KAMALI",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Bashayer Alfathly",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Siji Njondimakkal",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Qaiser Hameed",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Leigh Leigh",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "ARSLAN KHAN",
        "rating": 4,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Najeeb Khan",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Maria lopes",
        "rating": 2,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "mustafa.m",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Deborah Ferreira",
        "rating": 4,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Evelin Mate",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Hira Bashir",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Mehdi Matthew",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Asif Naveed",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "YTMasterYT",
        "rating": 5,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "REEMA SHEIK",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Grazi Fernandes (grazigameplayuk)",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "Rihanna Brown",
        "rating": 4,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "C H",
        "rating": 2,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    },
    {
        "reviewerName": "KHAN ARHA",
        "rating": 1,
        "reviewText": "",
        "reactions": 0,
        "reviewDate": "Unknown",
        "isOwnerReply": false
    }
]